import type React from "react"
import type { Metadata } from "next"
import { Cairo } from "next/font/google"
import "./globals.css"

const cairo = Cairo({
  weight: ["200", "300", "400", "500", "600", "700", "800", "900"],
  subsets: ["arabic", "latin"],
  variable: "--font-cairo",
  display: "swap",
})

export const metadata: Metadata = {
  title: "مؤسسة العميد | تركيب كاميرات مراقبة وأنظمة أمنية بالرياض",
  description: " 🎥 توريد وتركيب جميع أنواع كاميرات المراقبة - أفضل شركة أنظمة أمنية في الرياض",
  keywords: [
    "أنظمة أمنية", "كاميرات مراقبة", "مؤسسة العميد", "Smart Security",
    "كاميرات مراقبة الرياض", "تركيب كاميرات الرياض", "صيانة كاميرات الرياض", "فني كاميرات الرياض", "محلات كاميرات مراقبة الرياض",
    "تركيب كاميرات مراقبة", "صيانة كاميرات مراقبة", "تصحيح كاميرات", "برمجة كاميرات", "تمديد شبكات", "تركيب انتركوم",
    "كاميرات طاقة شمسية", "كاميرات واي فاي", "كاميرات لاسلكية", "كاميرات 4G", "كاميرات هيك فيجن", "كاميرات داهوا",
    "اصلاح كاميرات مراقبة", "حل مشاكل الكاميرات", "صيانة انظمة امنية"
  ],
  openGraph: {
    title: "مؤسسة العميد | تركيب كاميرات مراقبة وأنظمة أمنية بالرياض",
    description: " 🎥 توريد وتركيب جميع أنواع كاميرات المراقبة",
    siteName: "العميد للمراقبة الأمنية",
    type: "website",
    locale: "ar_SA",
  },
  twitter: {
    card: "summary_large_image",
    title: "مؤسسة العميد | تركيب كاميرات مراقبة وأنظمة أمنية بالرياض",
    description: " 🎥 توريد وتركيب جميع أنواع كاميرات المراقبة",
  },
  other: {
    "google-site-verification": "google94f7b4e52b6501ad.html"
  }
}

export default function RootLayout({
  children,
}: {
  children: React.ReactNode
}) {
  return (
    <html lang="ar" dir="rtl" className={`${cairo.variable} font-sans`} suppressHydrationWarning>
      <body suppressHydrationWarning>{children}</body>
    </html>
  )
}
